Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>libp2p</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # github_repository_collaborator.this["universal-connectivity:go-libp2p maintainers"] will be created
  + resource "github_repository_collaborator" "this" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "maintain"
      + permission_diff_suppression = false
      + repository                  = "universal-connectivity"
      + username                    = "go-libp2p Maintainers"
    }

  # github_repository_collaborator.this["universal-connectivity:js-libp2p-dev"] will be created
  + resource "github_repository_collaborator" "this" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "maintain"
      + permission_diff_suppression = false
      + repository                  = "universal-connectivity"
      + username                    = "js-libp2p-dev"
    }

  # github_repository_collaborator.this["universal-connectivity:maschad"] will be destroyed
  # (because key ["universal-connectivity:maschad"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "universal-connectivity:maschad" -> null
      - permission = "maintain" -> null
      - repository = "universal-connectivity" -> null
      - username   = "maschad" -> null
    }

  # github_repository_collaborator.this["universal-connectivity:mxinden"] will be destroyed
  # (because key ["universal-connectivity:mxinden"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id                          = "universal-connectivity:mxinden" -> null
      - permission                  = "maintain" -> null
      - permission_diff_suppression = false -> null
      - repository                  = "universal-connectivity" -> null
      - username                    = "mxinden" -> null
    }

  # github_repository_collaborator.this["universal-connectivity:rust-libp2p maintainers"] will be created
  + resource "github_repository_collaborator" "this" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "maintain"
      + permission_diff_suppression = false
      + repository                  = "universal-connectivity"
      + username                    = "rust-libp2p Maintainers"
    }

  # github_repository_file.this["interop/.github/workflows/semantic-pull-request.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "master"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/workflows/semantic-pull-request.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            name: Semantic PR
            
            on:
              pull_request_target:
                types:
                  - opened
                  - edited
                  - synchronize
            
            jobs:
              main:
                uses: pl-strflt/.github/.github/workflows/reusable-semantic-pull-request.yml@v0.3
        EOT
      + file                = ".github/workflows/semantic-pull-request.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "interop"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["universal-connectivity/codeowners"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "main"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update CODEOWNERS [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            rust-peer/* @libp2p/rust-libp2p-maintainers
            go-peer/* @libp2p/go-libp2p-maintainers
            js-peer/* @libp2p/js-libp2p-dev
        EOT
      + file                = "CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "universal-connectivity"
      + sha                 = (known after apply)
    }

Plan: 5 to add, 0 to change, 2 to destroy.
```

</details>
<!-- Sticky Pull Request Comment -->